Repository: fxanhkhoa/what_to_eat_ios
Catalog: what_to_eat_ios/Resources/*.lproj/Localizable.strings
Languages: vi

# app_name
source: What to Eat
vi: Ăn Gì Đây

source: Loading...
vi: Đang tải...

source: Error
vi: Lỗi

source: Retry
vi: Thử lại

source: Cancel
vi: Hủy

source: OK
vi: Đồng ý

# home_title
source: Home
vi: Trang chủ

source: Featured Dishes
vi: Món ăn nổi bật

source: Popular Dishes
vi: Món ăn phổ biến

source: Search dishes...
vi: Tìm kiếm món ăn...

# no_results
source: No results found
vi: Không tìm thấy kết quả

source: See All
vi: Xem tất cả

source: Description
vi: Mô Tả

source: Ingredients
vi: Nguyên Liệu

source: Instructions
vi: Hướng Dẫn

source: Tags
vi: Thẻ

# preparation
source: Prep
vi: Chuẩn Bị

# cooking
source: Cook
vi: Nấu

# servings
source: Serves
vi: Khẩu Phần

source: mins
vi: phút

# recipe_content
source: Recipe
vi: Công Thức

source: Meal Categories
vi: Loại Bữa Ăn

source: Ingredient Categories
vi: Loại Nguyên Liệu

source: Reviews
vi: Đánh giá

# related_dishes
source: You may also like
vi: Có thể bạn sẽ thích

source: Settings
vi: Cài đặt

source: Language
vi: Ngôn ngữ

source: Dark Mode
vi: Chế độ tối

source: Notifications
vi: Thông báo

source: About
vi: Giới thiệu

source: Version
vi: Phiên bản

# game_title
source: Food Game
vi: Trò chơi thức ăn

source: Start Game
vi: Bắt đầu chơi

source: Game Over
vi: Kết thúc

source: Play Again
vi: Chơi lại

# your_score
source: Your Score: %d
vi: Điểm của bạn: %d

# game_section_title
source: Food Games
vi: Trò chơi

# game_section_subtitle
source: Choose your favorite game to decide what to eat!
vi: Hãy chọn trò chơi yêu thích để quyết định ăn gì!

source: Featured Games
vi: Trò chơi nổi bật

source: Coming Soon
vi: Sắp ra mắt

source: Play Now
vi: Chơi ngay

# untitle
source: Untitled
vi: Không có tiêu đề

# home_banner_title
source: Hungry? Eat What
vi: Đói Bụng? Ăn Gì?

# home_banner_subtitle
source: Unlock a world of dining options and find your next meal, conveniently and wherever you are.
vi: Khám phá thế giới ẩm thực và tìm kiếm bữa ăn tiếp theo một cách thuận tiện, mọi lúc mọi nơi.

source: Find Your Meal
vi: Tìm Món Ăn

source: Live
vi: Trực tuyến

source: Disconnected
vi: Mất kết nối

source: Reconnect
vi: Kết nối lại

source: Contact Us
vi: Liên Hệ

source: Name
vi: Họ Tên

source: Message
vi: Tin Nhắn

source: Send Message
vi: Gửi Tin Nhắn

# or_contact_directly
source: Or Contact Us Directly
vi: Hoặc Liên Hệ Trực Tiếp

# follow_us
source: Follow Us On
vi: Theo Dõi Chúng Tôi

# name_required
source: Please enter your name
vi: Vui lòng nhập họ tên

# valid_email_required
source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

# message_required
source: Please enter your message
vi: Vui lòng nhập tin nhắn

# message_sent_success
source: Your message has been sent successfully!
vi: Tin nhắn của bạn đã được gửi thành công!

source: Success
vi: Thành Công

source: Wheel of Fortune
vi: Vòng Quay May Mắn

# wheel_of_fortune_description
source: Spin the wheel to discover your next meal!
vi: Quay bánh xe để khám phá bữa ăn tiếp theo của bạn!

source: Spin the Wheel!
vi: Quay Bánh Xe!

source: Spinning...
vi: Đang quay...

# winner_celebration
source: ðŸŽ‰ Winner! ðŸŽ‰
vi: 🎉 Người chiến thắng! 🎉

source: Tap to view details
vi: Nhấn để xem chi tiết

source: Filter Dishes
vi: Lọc món ăn

source: Cooking Time
vi: Thời gian nấu

source: Preparation Time (minutes)
vi: Thời gian chuẩn bị (phút)

source: Min
vi: Tối thiểu

source: Max
vi: Tối đa

source: Difficulty Level
vi: Độ khó

source: Meal Categories
vi: Loại bữa ăn

source: Ingredient Categories
vi: Loại nguyên liệu

source: Tags
vi: Thẻ

source: Add custom tags
vi: Thêm thẻ tùy chỉnh

source: Enter tag and press return
vi: Nhập thẻ và nhấn enter

source: Add
vi: Thêm

source: Cancel
vi: Hủy

source: Apply
vi: Áp dụng

source: Clear All Filters
vi: Xóa tất cả bộ lọc

source: Clear All
vi: Xóa tất cả

source: dishes
vi: Món ăn

source: Filter Ingredients
vi: Lọc nguyên liệu

source: Select categories to filter ingredients
vi: Chọn loại để lọc nguyên liệu

source: Apply Filter
vi: Áp dụng bộ lọc

# categories_selected
source: %d categories selected
vi: %d loại đã chọn

source: Reset
vi: Đặt lại

# difficulty_easy
source: Easy
vi: Dễ

# difficulty_medium
source: Medium
vi: Trung bình

# difficulty_hard
source: Hard
vi: Khó

# category_breakfast
source: Breakfast
vi: Bữa sáng

# category_lunch
source: Lunch
vi: Bữa trưa

# category_brunch
source: Brunch
vi: Bữa brunch

# category_dinner
source: Dinner
vi: Bữa tối

# category_burger
source: Burger
vi: Bánh burger

# category_soup
source: Soup
vi: Súp

# category_appetizer
source: Appetizer
vi: Khai vị

# category_dessert
source: Dessert
vi: Tráng miệng

# category_hotpot
source: Hotpot
vi: Lẩu

# category_north_vn
source: North Vietnam
vi: Miền Bắc

# category_central_vn
source: Central Vietnam
vi: Miền Trung

# category_south_vn
source: South Vietnam
vi: Miền Nam

# category_sweet_soup
source: Sweet Soup
vi: Chè

# ingredient_category_milk_and_dairy
source: Milk and Dairy
vi: Sữa và sản phẩm từ sữa

# ingredient_category_grains
source: Grains
vi: Ngũ cốc

# ingredient_category_beverages_nonalcoholic
source: Non-Alcoholic Beverages
vi: Đồ uống không cồn

# ingredient_category_protein_foods
source: Protein Foods
vi: Thực phẩm giàu protein

# ingredient_category_snacks_and_sweets
source: Snacks and Sweets
vi: Đồ ăn vặt và kẹo

# ingredient_category_alcoholic_beverages
source: Alcoholic Beverages
vi: Đồ uống có cồn

# ingredient_category_water
source: Water
vi: Nước

# ingredient_category_fats_and_oils
source: Fats and Oils
vi: Chất béo và dầu

# ingredient_category_mixed_dishes
source: Mixed Dishes
vi: Món ăn hỗn hợp

# ingredient_category_fruit
source: Fruit
vi: Trái cây

# ingredient_category_condiments_and_sauces
source: Condiments and Sauces
vi: Gia vị và nước sốt

# ingredient_category_sugars
source: Sugars
vi: Đường

# ingredient_category_vegetables
source: Vegetables
vi: Rau củ

# ingredient_category_infant_formula_and_baby_food
source: Infant Formula and Baby Food
vi: Sữa công thức và thức ăn trẻ em

# ingredient_category_other
source: Other
vi: Khác

source: Ingredient
vi: Nguyên liệu

source: Unknown Ingredient
vi: Không rõ nguyên liệu

source: Measure:
vi: Đơn vị:

source: Weight:
vi: Khối lượng:

source: Nutrition Information
vi: Thông tin dinh dưỡng

source: Calories
vi: Calo

source: Carbohydrates
vi: Carbohydrate

source: Fat
vi: Chất béo

source: Sodium
vi: Natri

source: Categories
vi: Phân loại

source: Additional Information
vi: Thông tin bổ sung

source: Created
vi: Ngày tạo

source: Updated
vi: Ngày cập nhật

# nutrition_per_measure
source: Nutrition (per
vi: Dinh dưỡng (trên

# ingredients_title
source: Ingredients
vi: Nguyên liệu

source: Search ingredients...
vi: Tìm kiếm nguyên liệu...

source: All
vi: Tất cả

source: Unknown
vi: Không rõ

source: Cal
vi: Calo

source: No Ingredients Found
vi: Không tìm thấy nguyên liệu

# try_adjusting_search
source: Try adjusting your search or filter criteria
vi: Hãy thử thay đổi từ khóa hoặc bộ lọc

source: Loading ingredients...
vi: Đang tải nguyên liệu...

source: Flipping Card
vi: Lật Thẻ

source: Score
vi: Điểm

source: Moves
vi: Nước đi

source: Time
vi: Thời gian

source: pairs matched
vi: cặp đã ghép

source: New Game
vi: Ván mới

source: Pause
vi: Tạm dừng

source: Resume
vi: Tiếp tục

source: Game Completed!
vi: Hoàn thành trò chơi!

# congratulations
source: Congratulations! You've matched all pairs!
vi: Chúc mừng! Bạn đã ghép được tất cả các cặp!

source: Final Score
vi: Điểm cuối cùng

source: Total Moves
vi: Tổng số nước đi

source: Time Taken
vi: Thời gian sử dụng

source: Close
vi: Đóng

source: Unknown Dish
vi: Món ăn không xác định

source: Loading dishes...
vi: Đang tải món ăn...

source: No dishes available
vi: Không có món ăn nào

# check_connection_try_again
source: Please check your connection and try again
vi: Vui lòng kiểm tra kết nối và thử lại

source: Pick a Card
vi: Chọn một thẻ

# tap_card_to_reveal_dish
source: Tap any card to reveal your random dish
vi: Chạm vào bất kỳ thẻ nào để khám phá món ăn ngẫu nhiên

source: Mystery Dish
vi: Món ăn bí ẩn

# choose_your_destiny
source: Choose your culinary destiny...
vi: Chọn ngẫu nhiên món ăn...

source: Dish Revealed!
vi: Món ăn đã được tiết lộ!

# your_random_dish_is
source: Your random dish is ready!
vi: Món ăn ngẫu nhiên của bạn đã sẵn sàng!

source: Try Again
vi: Thử lại

source: Loading games...
vi: Đang tải trò chơi...

source: Loading data...
vi: Đang tải dữ liệu...

source: Connecting...
vi: Đang kết nối...

source: Searching...
vi: Đang tìm kiếm...

source: No Items Found
vi: Không tìm thấy mục nào

# try_adjusting_search_criteria
source: Try adjusting your search criteria
vi: Hãy thử điều chỉnh tiêu chí tìm kiếm

source: No Dishes Found
vi: Không tìm thấy món ăn

# try_adjusting_dish_filters
source: Try adjusting your dish filters
vi: Hãy thử điều chỉnh bộ lọc món ăn

source: No Games Available
vi: Không có trò chơi nào

# check_back_later
source: Check back later for new games
vi: Hãy quay lại sau để có trò chơi mới

source: Connection Error
vi: Lỗi kết nối

source: Pick Dishes for Wheel
vi: Chọn món ăn cho bánh xe

source: Selected Dishes
vi: Món ăn đã chọn

# no_dishes_selected
source: No dishes selected yet
vi: Chưa chọn món ăn nào

source: Dishes on Wheel
vi: Món ăn trên bánh xe

# no_dishes_on_wheel
source: No dishes on wheel yet
vi: Chưa có món ăn nào trên bánh xe

source: Add Dishes
vi: Thêm món ăn

source: Add More
vi: Thêm nữa

source: Done
vi: Xong

source: Pick Dishes for Cards
vi: Chọn món ăn cho thẻ

source: Dishes in Game
vi: Món ăn trong game

source: No Dishes for Game
vi: Không có món ăn cho trò chơi

# add_dishes_to_start_playing
source: Add dishes to start playing the card flipping game
vi: Thêm món ăn để bắt đầu chơi game lật thẻ

# home_tab
source: Home
vi: Trang chủ

# dish_tab
source: Dish
vi: Món ăn

# ingredient_tab
source: Ingredient
vi: Nguyên liệu

# game_tab
source: Game
vi: Trò chơi

# setting_tab
source: Setting
vi: Cài đặt

source: Welcome Back
vi: Chào Mừng Trở Lại

source: Signing in...
vi: Đang đăng nhập...

source: Sign Out
vi: Đăng xuất

source: Profile
vi: Hồ sơ

source: Voting Game
vi: Trò Chơi Bình Chọn

source: Create Vote
vi: Tạo Bình Chọn

source: Vote Title
vi: Tiêu Đề Bình Chọn

source: Vote Description
vi: Mô Tả Bình Chọn

# search_and_add
source: Search & Add Dishes
vi: Tìm & Thêm Món Ăn

source: Add Custom Dish
vi: Thêm món tuỳ chỉnh

# custom_dish_header_desc
source: Create a custom dish entry with a title and optional image URL
vi: Tạo món ăn tuỳ chỉnh với tiêu đề và URL hình ảnh (không bắt buộc)

# custom_dish_title
source: Dish Title
vi: Tên món ăn

# custom_dish_title_placeholder
source: Enter dish title
vi: Nhập tên món ăn

# custom_dish_url
source: Dish Image URL
vi: URL hình ảnh món ăn

# custom_dish_url_helper
source: The URL is optional and can be used for a dish image. If not provided, a default icon will be used.
vi: URL là tuỳ chọn, dùng cho hình ảnh món ăn. Nếu không nhập, sẽ dùng biểu tượng mặc định.

source: Preview
vi: Xem trước

# custom_dish
source: Custom
vi: Món tuỳ chỉnh

# custom_dish_preview_placeholder
source: Enter a dish title to see preview
vi: Nhập tên món để xem trước

# custom_dish_bottom_desc
source: Title required, URL optional
vi: Bắt buộc tên, URL tuỳ chọn

# custom_dish_alert_empty_title
source: Please enter a dish title
vi: Vui lòng nhập tên món ăn

# custom_dish_alert_duplicate_title
source: A custom dish with this title already exists
vi: Đã có món tuỳ chỉnh với tên này

# custom_dish_alert_invalid_url
source: Please enter a valid URL or leave it empty
vi: Vui lòng nhập URL hợp lệ hoặc để trống

source: Create Voting Session
vi: Tạo Phiên Bình Chọn

# add_dish_prompt
source: Search for dishes or add custom ones to create your voting session
vi: Tìm kiếm món ăn hoặc thêm món ăn tùy chỉnh để tạo phiên bình chọn

source: Vote created successfully!
vi: Tạo bình chọn thành công!

# minimum_dishes_required
source: Please add at least 2 dishes to create a vote
vi: Vui lòng thêm ít nhất 2 món ăn để tạo bình chọn

# enter_vote_title
source: Please enter a vote title
vi: Vui lòng nhập tiêu đề bình chọn

# dish_already_added
source: This dish is already added
vi: Món ăn này đã được thêm

source: From Database
vi: Từ Cơ Sở Dữ Liệu

# confirm_clear
source: Are you sure you want to clear all selected dishes?
vi: Bạn có chắc chắn muốn xóa tất cả món ăn đã chọn?

source: Clear
vi: Xóa

source: Search vote games...
vi: Tìm kiếm trò chơi bình chọn...

source: No Vote Games Found
vi: Không Tìm Thấy Trò Chơi Bình Chọn

# create_first_vote_game
source: Create your first vote game to get started
vi: Tạo trò chơi bình chọn đầu tiên để bắt đầu

source: Back
vi: Quay Lại

source: Active
vi: Đang Hoạt Động

source: votes
vi: lượt bình chọn

source: Dishes in this vote:
vi: Món ăn trong bình chọn này:

source: View Results
vi: Xem Kết Quả

source: Vote Now
vi: Bình Chọn Ngay

source: more
vi: thêm

source: Custom
vi: Tùy Chỉnh

source: Login Required
vi: Yêu cầu đăng nhập

# login_required_message
source: Please login to access voting games and participate in community voting.
vi: Vui lòng đăng nhập để truy cập trò chơi bình chọn và tham gia bình chọn cộng đồng.

source: Login to Continue
vi: Đăng nhập để tiếp tục

source: Go Back
vi: Quay lại

source: Voting Games
vi: Danh sách bình chọn

source: Filter Vote Games
vi: Lọc trò chơi bình chọn

# filter_and_sort
source: Filter & Sort
vi: Lọc & Sắp xếp

# customize_vote_games_display
source: Customize how vote games are displayed and sorted
vi: Tuỳ chỉnh cách hiển thị và sắp xếp trò chơi bình chọn

source: Sort Options
vi: Tuỳ chọn sắp xếp

source: Sort By
vi: Sắp xếp theo

source: Creation Date
vi: Ngày tạo

# sort_by_creation_date
source: When the vote was created
vi: Thời điểm tạo bình chọn

source: Title
vi: Tiêu đề

# sort_by_title
source: Alphabetical by vote title
vi: Theo thứ tự bảng chữ cái

source: Vote Count
vi: Số lượt bình chọn

# sort_by_vote_count
source: Number of votes received
vi: Số lượt bình chọn nhận được

source: Dish Count
vi: Số món ăn

# sort_by_dish_count
source: Number of dishes in the vote
vi: Số món ăn trong bình chọn

source: Sort Order
vi: Thứ tự sắp xếp

source: Newest First
vi: Mới nhất trước

source: Oldest First
vi: Cũ nhất trước

source: Quick Filters
vi: Bộ lọc nhanh

source: Most Popular
vi: Phổ biến nhất

# sort_by_vote_count_desc
source: Sort by vote count (highest first)
vi: Sắp xếp theo lượt bình chọn (cao nhất trước)

source: Recently Created
vi: Mới tạo gần đây

# show_newest_first
source: Show newest vote games first
vi: Hiển thị bình chọn mới nhất trước

source: Most Dishes
vi: Nhiều món nhất

# votes_with_most_dishes
source: Votes with the most dish options
vi: Bình chọn có nhiều món nhất

source: Alphabetical
vi: Theo bảng chữ cái

# sort_by_title_az
source: Sort by title A to Z
vi: Sắp xếp theo tiêu đề A-Z

source: Apply Filters
vi: Áp dụng bộ lọc

source: Live Vote Game
vi: Bình chọn trực tiếp

source: Live Chat
vi: Trò chuyện trực tiếp

source: Playing as: %@
vi: Đang chơi với tên: %@

source: Live Results
vi: Kết quả trực tiếp

source: Live Updates
vi: Cập nhật trực tiếp

# votes_count
source: %d votes
vi: %d lượt bình chọn

source: Untitled
vi: Không có tiêu đề

# voters_count
source: %d voters
vi: %d người bình chọn

# voter_singular
source: %d anonymous voter
vi: %d người ẩn danh

# voter_plural
source: %d anonymous voters
vi: %d người ẩn danh

source: Loading voters...
vi: Đang tải danh sách bình chọn...

source: Cast Your Vote
vi: Bình chọn của bạn

source: Submit Vote
vi: Gửi bình chọn
